# ExportFontKey Class

---
A key used to represent an item stored in an ExportFontTable.
SystemObject Autodesk.Revit.DBExportFontKey
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ExportFontKey : IDisposable

    Public Class ExportFontKey
    	Implements IDisposable

    public ref class ExportFontKey : IDisposable

    type ExportFontKey =
        class
            interface IDisposable
        end
The ExportFontKey type exposes the following members.
| Name| Description
---|---|---
| ExportFontKey|  Constructs a new default ExportFontKey.
| ExportFontKey(ExportFontKey)|  Constructs a new copy of the input ExportFontKey object.
| ExportFontKey(String)|  Constructs a new ExportFontKey using an input font name.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OriginalFontName|  The original font name.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ExportFontKey
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace